{"config": [{"config": {"batch_input_shape": [null, 28, 28, 1], "data_format": "channels_last", "name": "conv2d_1", "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "filters": 32, "trainable": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "conv2d_2", "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "filters": 64, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 128, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 10, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax", "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.6", "class_name": "Sequential"}