{"config": [{"config": {"filters": 128, "kernel_constraint": null, "activation": "relu", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [7, 7], "trainable": true, "strides": [1, 1], "name": "conv2d_1", "batch_input_shape": [null, 128, 128, 3], "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"filters": 64, "kernel_constraint": null, "activation": "relu", "name": "conv2d_2", "kernel_size": [7, 7], "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 64, "kernel_constraint": null, "activation": "relu", "name": "conv2d_3", "kernel_size": [5, 5], "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "activation": "relu", "bias_constraint": null, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "units": 128, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "relu", "bias_constraint": null, "trainable": true, "name": "dense_2", "kernel_regularizer": null, "units": 64, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activation": "relu", "bias_constraint": null, "trainable": true, "name": "dense_3", "kernel_regularizer": null, "units": 32, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "activation": "softmax", "bias_constraint": null, "trainable": true, "name": "dense_4", "kernel_regularizer": null, "units": 2, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6"}