{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.6", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "filters": 128, "strides": [1, 1], "dilation_rate": [1, 1], "batch_input_shape": [null, 128, 128, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "bias_constraint": null, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "bias_constraint": null, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "bias_constraint": null, "trainable": true, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "units": 128, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "units": 64, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "units": 32, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.5}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "units": 2, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "softmax"}}]}