{"keras_version": "2.0.6", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "dtype": "float32", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "batch_input_shape": [null, 32, 32, 3], "padding": "valid", "use_bias": true, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_1", "filters": 32}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "use_bias": true, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_2", "filters": 64}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null}}], "class_name": "Sequential"}